Revit 2026 API

# FailuresAccessorIsTransactionBeingCommitted Method

---

Checks if the transaction for which failures are processed is being committed or rolled back.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsTransactionBeingCommitted()
```
```vb
Public Function IsTransactionBeingCommitted As Boolean
```
```cpp
public:
bool IsTransactionBeingCommitted()
```
```fsharp
member IsTransactionBeingCommitted : unit -> bool
```

#### Return Value

Boolean True if current transaction is being committed, false if the transaction is being rolled back.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

A transaction is considered as "being committed" if a caller has requested the transaction to be committed and no previous failure processing operation requested the transaction to be rolled back.

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace